#/usr/bin/env python3
# -*- coding: utf-8 -*-

from collections import OrderedDict

d2r_dict=OrderedDict([
('ँ', ' ̃'),

('ख्', 'kh'),
('क्', 'k'),
('घ्', 'gh'),
('ग्', 'g'),
('ङ्', 'ṅ'),

('छ्', 'ch'),
('च्', 'c'),
('झ्', 'jh'),
('ज्', 'j'),
('ञ्', 'ñ'),

('ठ्', 'ṭh'),
('ट्', 'ṭ'),
('ढ्', 'ḍh'),
('ड्', 'ḍ'),
('ण्', 'ṇ'),

('थ्', 'th'),
('त्', 't'),
('ध्', 'dh'),
('द्', 'd'),
('न्', 'n'),

('फ्', 'ph'),
('प्', 'p'),
('भ्', 'bh'),
('ब्', 'b'),
('म्', 'm'),

('य्', 'y'),
('र्', 'r'),
('ल्', 'l'),
('व्', 'v'),
('श्', 'ś'),
('ष्', 'ṣ'),
('स्', 's'),
('ह्', 'h'),

('का', 'kā'),
('खा', 'khā'),
('गा', 'gā'),
('घा', 'ghā'),
('ङा', 'ṅā'),

('चा', 'cā'),
('छा', 'chā'),
('जा', 'jā'),
('झा', 'jhā'),
('ञा', 'ñā'),

('टा', 'ṭā'),
('ठा', 'ṭhā'),
('डा', 'ḍā'),
('ढा', 'ḍhā'),
('णा', 'ṇā'),

('ता', 'tā'),
('था', 'thā'),
('दा', 'dā'),
('धा', 'dhā'),
('ना', 'nā'),

('पा', 'pā'),
('फा', 'phā'),
('बा', 'bā'),
('भा', 'bhā'),
('मा', 'mā'),

('या', 'yā'),
('रा', 'rā'),
('ला', 'lā'),
('वा', 'vā'),
('शा', 'śā'),
('षा', 'ṣā'),
('सा', 'sā'),
('हा', 'hā'),

('खै', 'khai'),
('कै', 'kai'),
('घै', 'ghai'),
('गै', 'gai'),
('ङै', 'ṅai'),

('छै', 'chai'),
('चै', 'cai'),
('झै', 'jhai'),
('जै', 'jai'),
('ञै', 'ñai'),

('ठै', 'ṭhai'),
('टै', 'ṭai'),
('ढै', 'ḍhai'),
('डै', 'ḍai'),
('णै', 'ṇai'),

('थै', 'thai'),
('तै', 'tai'),
('धै', 'dhai'),
('दै', 'dai'),
('नै', 'nai'),

('फै', 'phai'),
('पै', 'pai'),
('भै', 'bhai'),
('बै', 'bai'),
('मै', 'mai'),

('यै', 'yai'),
('रै', 'rai'),
('लै', 'lai'),
('वै', 'vai'),
('शै', 'śai'),
('षै', 'ṣai'),
('सै', 'sai'),
('है', 'hai'),

('खौ', 'khau'),
('कौ', 'kau'),
('घौ', 'ghau'),
('गौ', 'gau'),
('ङौ', 'ṅau'),

('छौ', 'chau'),
('चौ', 'cau'),
('झौ', 'jhau'),
('जौ', 'jau'),
('ञौ', 'ñau'),

('ठौ', 'ṭhau'),
('टौ', 'ṭau'),
('ढौ', 'ḍhau'),
('डौ', 'ḍau'),
('णौ', 'ṇau'),

('थौ', 'thau'),
('तौ', 'tau'),
('धौ', 'dhau'),
('दौ', 'dau'),
('नौ', 'nau'),

('फौ', 'phau'),
('पौ', 'pau'),
('भौ', 'bhau'),
('बौ', 'bau'),
('मौ', 'mau'),

('यौ', 'yau'),
('रौ', 'rau'),
('लौ', 'lau'),
('वौ', 'vau'),
('शौ', 'śau'),
('षौ', 'ṣau'),
('सौ', 'sau'),
('हौ', 'hau'),

('खी', 'khī'),
('की', 'kī'),
('घी', 'ghī'),
('गी', 'gī'),
('ङी', 'ṅī'),

('छी', 'chī'),
('ची', 'cī'),
('झी', 'jhī'),
('जी', 'jī'),
('ञी', 'ñī'),

('ठी', 'ṭhī'),
('टी', 'ṭī'),
('ढी', 'ḍhī'),
('डी', 'ḍī'),
('णी', 'ṇī'),

('थी', 'thī'),
('ती', 'tī'),
('धी', 'dhī'),
('दी', 'dī'),
('नी', 'nī'),

('फी', 'phī'),
('पी', 'pī'),
('भी', 'bhī'),
('बी', 'bī'),
('मी', 'mī'),

('यी', 'yī'),
('री', 'rī'),
('ली', 'lī'),
('वी', 'vī'),
('शी', 'śī'),
('षी', 'ṣī'),
('सी', 'sī'),
('ही', 'hī'),

('खि', 'khi'),
('कि', 'ki'),
('घि', 'ghi'),
('गि', 'gi'),
('ङि', 'ṅi'),

('छि', 'chi'),
('चि', 'ci'),
('झि', 'jhi'),
('जि', 'ji'),
('ञि', 'ñi'),

('ठि', 'ṭhi'),
('टि', 'ṭi'),
('ढि', 'ḍhi'),
('डि', 'ḍi'),
('णि', 'ṇi'),

('थि', 'thi'),
('ति', 'ti'),
('धि', 'dhi'),
('दि', 'di'),
('नि', 'ni'),

('फि', 'phi'),
('पि', 'pi'),
('भि', 'bhi'),
('बि', 'bi'),
('मि', 'mi'),

('यि', 'yi'),
('रि', 'ri'),
('लि', 'li'),
('वि', 'vi'),
('शि', 'śi'),
('षि', 'ṣi'),
('सि', 'si'),
('हि', 'hi'),

('खू', 'khū'),
('कू', 'kū'),
('घू', 'ghū'),
('गू', 'gū'),
('ङू', 'ṅū'),

('छू', 'chū'),
('चू', 'cū'),
('झू', 'jhū'),
('जू', 'jū'),
('ञू', 'ñū'),

('ठू', 'ṭhū'),
('टू', 'ṭū'),
('ढू', 'ḍhū'),
('डू', 'ḍū'),
('णू', 'ṇū'),

('थू', 'thū'),
('तू', 'tū'),
('धू', 'dhū'),
('दू', 'dū'),
('नू', 'nū'),

('फू', 'phū'),
('पू', 'pū'),
('भू', 'bhū'),
('बू', 'bū'),
('मू', 'mū'),

('यू', 'yū'),
('रू', 'rū'),
('लू', 'lū'),
('वू', 'vū'),
('शू', 'śū'),
('षू', 'ṣū'),
('सू', 'sū'),
('हू', 'hū'),

('खु', 'khu'),
('कु', 'ku'),
('घु', 'ghu'),
('गु', 'gu'),
('ङु', 'ṅu'),

('छु', 'chu'),
('चु', 'cu'),
('झु', 'jhu'),
('जु', 'ju'),
('ञु', 'ñu'),

('ठु', 'ṭhu'),
('टु', 'ṭu'),
('ढु', 'ḍhu'),
('डु', 'ḍu'),
('णु', 'ṇu'),

('थु', 'thu'),
('तु', 'tu'),
('धु', 'dhu'),
('दु', 'du'),
('नु', 'nu'),

('फु', 'phu'),
('पु', 'pu'),
('भु', 'bhu'),
('बु', 'bu'),
('मु', 'mu'),

('यु', 'yu'),
('रु', 'ru'),
('लु', 'lu'),
('वु', 'vu'),
('शु', 'śu'),
('षु', 'ṣu'),
('सु', 'su'),
('हु', 'hu'),

('खे', 'khe'),
('के', 'ke'),
('घे', 'ghe'),
('गे', 'ge'),
('ङे', 'ṅe'),

('छे', 'che'),
('चे', 'ce'),
('झे', 'jhe'),
('जे', 'je'),
('ञे', 'ñe'),

('ठे', 'ṭhe'),
('टे', 'ṭe'),
('ढे', 'ḍhe'),
('डे', 'ḍe'),
('णे', 'ṇe'),

('थे', 'the'),
('ते', 'te'),
('धे', 'dhe'),
('दे', 'de'),
('ने', 'ne'),

('फे', 'phe'),
('पे', 'pe'),
('भे', 'bhe'),
('बे', 'be'),
('मे', 'me'),

('ये', 'ye'),
('रे', 're'),
('ले', 'le'),
('वे', 've'),
('शे', 'śe'),
('षे', 'ṣe'),
('से', 'se'),
('हे', 'he'),

('खो', 'kho'),
('को', 'ko'),
('घो', 'gho'),
('गो', 'go'),
('ङो', 'ṅo'),

('छो', 'cho'),
('चो', 'co'),
('झो', 'jho'),
('जो', 'jo'),
('ञो', 'ño'),

('ठो', 'ṭho'),
('टो', 'ṭo'),
('ढो', 'ḍho'),
('डो', 'ḍo'),
('णो', 'ṇo'),

('थो', 'tho'),
('तो', 'to'),
('धो', 'dho'),
('दो', 'do'),
('नो', 'no'),

('फो', 'pho'),
('पो', 'po'),
('भो', 'bho'),
('बो', 'bo'),
('मो', 'mo'),

('यो', 'yo'),
('रो', 'ro'),
('लो', 'lo'),
('वो', 'vo'),
('शो', 'śo'),
('षो', 'ṣo'),
('सो', 'so'),
('हो', 'ho'),

('ख', 'kha'),
('क', 'ka'),
('घ', 'gha'),
('ग', 'ga'),
('ङ', 'ṅa'),

('छ', 'cha'),
('च', 'ca'),
('झ', 'jha'),
('ज', 'ja'),
('ञ', 'ña'),

('ठ', 'ṭha'),
('ट', 'ṭa'),
('ढ', 'ḍha'),
('ड', 'ḍa'),
('ण', 'ṇa'),

('थ', 'tha'),
('त', 'ta'),
('ध', 'dha'),
('द', 'da'),
('न', 'na'),

('फ', 'pha'),
('प', 'pa'),
('भ', 'bha'),
('ब', 'ba'),
('म', 'ma'),

('य', 'ya'),
('र', 'ra'),
('ल', 'la'),
('व', 'va'),
('श', 'śa'),
('ष', 'ṣa'),
('स', 'sa'),
('ह', 'ha'),

('आ', 'ā'),
('ऐ', 'ai'),
('औ', 'au'),
('ई', 'ī'),
('इ', 'i'),
('ऊ', 'ū'),
('उ', 'u'),
('ए', 'e'),
('ओ', 'o'),
('अ', 'a'),

('ं', 'ṃ'),
('aृ', 'r̥'),

('ā ̃', 'ā̃'),
('ai ̃', 'aĩ'),
('au ̃', 'aũ'),
('ī ̃', 'ī̃'),
('i ̃', 'ĩ'),
('ū ̃', 'ū̃'),
('u ̃', 'ũ'),
('e ̃', 'ẽ'),
('o ̃', 'õ'),
('a ̃', 'ã'),
#deletes U+200D ZERO WIDTH JOINER [ZWJ] and U+200C ZERO WIDTH NON-JOINER [ZWNJ] which were showing up untransliterated
('‍', ''),
('‌', ''),
])

def is_devanagari(text):
    text = "".join(i for i in text if i.isalnum())
    return (sum(True for i in text if ord(i) in range(2304, 2432)) / len(text)) >= 0.5

def romanize_text(text):
    dict = {}
    if type(text) == float:
        return
    for key, value in d2r_dict.items():
        text = text.replace(key, value)
        dict[value] = text

    print (text)
    return (text)

#export
import sys

stdoutOrigin = sys.stdout
sys.stdout = open('roman.csv', 'w')
#import
with open('nepali.csv', 'r') as f:
    f_contents = f.read()

romanize_text(f_contents)